/*
 *                        .::::.
 *                      .::::::::.
 *                     :::::::::::
 *                  ..:::::::::::'
 *               '::::::::::::'
 *                 .::::::::::
 *            '::::::::::::::..
 *                 ..::::::::::::.
 *               ``::::::::::::::::
 *                ::::``:::::::::'        .:::.
 *               ::::'   ':::::'       .::::::::.
 *             .::::'      ::::     .:::::::'::::.
 *            .:::'       :::::  .:::::::::' ':::::.
 *           .::'        :::::.:::::::::'      ':::::.
 *          .::'         ::::::::::::::'         ``::::.
 *      ...:::           ::::::::::::'              ``::.
 *     ````':.          ':::::::::'                  ::::..
 *                        '.:::::'                    ':'````..
 * 
 * @Author: ZJoker
 * @Date: 2022-11-19 17:01:32
 * @LastEditTime: 2022-11-21 11:13:28
 * @LastEditors: ZJoker
 * @Description: 
 * @FilePath: \learn-typescript\hello-typescript\helloTypescript.ts
 * 生活百般滋味，人生需要笑对
 */

function sayHello(message: string) {
  console.log(`Hello: ${message}`)
}
sayHello('ZJoker')